cfg/Catalogs/ВидыСтажа.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>ВидыСтажа</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ЛьготныйСтаж</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеЛьготногоСтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОснованияЛьготногоСтажа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСпособУчетаСтажа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьСпособыУчетаСтажа</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ограничение</Name>
					<Comment>Ограничение за месяц</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cfg/Catalogs/ВидыСтажа/Forms/ФормаЭлемента/Ext/Form/Module.bsl
// Устанавливает доступность и очищает реквизиты в зависимости
// от ЛьготныйСтаж
//
// Параметры
//  Нет
//
Процедура УстановитьДоступность(ОчищатьРеквизиты)

    Если ЛьготныйСтаж Тогда
		ЭлементыФормы.ОснованиеЛьготногоСтажа.Доступность = Истина; 
		ЭлементыФормы.Коэффициент.Доступность = Истина; 
	Иначе
		ЭлементыФормы.ОснованиеЛьготногоСтажа.Доступность = Ложь; 
		ЭлементыФормы.Коэффициент.Доступность = Ложь; 
	КонецЕсли;
	ЭлементыФормы.ОснованиеЛьготногоСтажа.ОтметкаНезаполненного = ЭлементыФормы.ОснованиеЛьготногоСтажа.Доступность;
	ЭлементыФормы.Коэффициент.ОтметкаНезаполненного = ЭлементыФормы.Коэффициент.Доступность;

	Если ОчищатьРеквизиты Тогда
        Коэффициент = ?(ЭлементыФормы.Коэффициент.Доступность, Коэффициент, 0);
		ОснованиеЛьготногоСтажа = ?(ЭлементыФормы.ОснованиеЛьготногоСтажа.Доступность, ОснованиеЛьготногоСтажа, NULL);
	КонецЕсли;	

КонецПроцедуры // УстановитьДоступность()


Процедура ЛьготныйСтажПриИзменении(Элемент)

	УстановитьДоступность(Истина);
	
КонецПроцедуры

Процедура ДействияФормыРедактироватьКод(Кнопка)
	МеханизмНумерацииОбъектов.ИзменениеВозможностиРедактированияНомера(ЭтотОбъект.Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
КонецПроцедуры

Процедура ПриОткрытии()

	МеханизмНумерацииОбъектов.ДобавитьВМенюДействияКнопкуРедактированияКода(ЭлементыФормы.ДействияФормы.Кнопки.Подменю);
	МеханизмНумерацииОбъектов.УстановитьДоступностьПоляВводаНомера(Метаданные(), ЭтаФорма, ЭлементыФормы.ДействияФормы.Кнопки.Подменю,ЭлементыФормы.Код);
	
	УстановитьДоступность(Ложь);
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ЛьготныйСтаж Тогда
		Если ОснованиеЛьготногоСтажа = Неопределено Тогда
			Предупреждение(НСтр("ru='Не заполнено основание льготного стажа!';uk='Не заповнена підстава пільгового стажу!'"));
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Коэффициент = Неопределено Тогда
		Предупреждение(НСтр("ru='Не заполнен коэффициент льготного стажа!';uk='Не заповнений коефіцієнт пільгового стажу!'"));
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события ПослеЗаписи формы.
//
Процедура ПослеЗаписи()
	
	МеханизмНумерацииОбъектов.ОбновитьПодсказкуКодНомерОбъекта(ЭтотОбъект.Метаданные(), ЭлементыФормы.ДействияФормы.Кнопки.Подменю, ЭлементыФормы.Код);
	
КонецПроцедуры
